MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F427CG/mcu.h
    __IM  uint32_t RESERVED;

    /* @brief QSPI Slave enable register */
    union
    {
        __IOM uint32_t SLAEN;
        struct
        {
            __IOM uint32_t SLAEN           : 1;
            __IM  uint32_t RESERVED        : 31;
        } SLAEN_B;
    };

    /* @brief Baudrate register */
    union
    {
        __IOM uint32_t BR;
        struct
        {
            __IOM uint32_t CLKDIV          : 16;
            __IM  uint32_t RESERVED        : 16;
        } BR_B;
    };

    /* @brief Transmission FIFO threshhold level register */
    union
    {
        __IOM uint32_t TFTL;
        struct
        {
            __IOM uint32_t TFT             : 3;
            __IM  uint32_t RESERVED1       : 13;
            __IOM uint32_t TFTH            : 3;
            __IM  uint32_t RESERVED2       : 13;
        } TFTL_B;
    };

    /* @brief Reception FIFO threshhold level register */
    union
    {
        __IOM uint32_t RFTL;
        struct
        {
            __IOM uint32_t RFT             : 3;
            __IM  uint32_t RESERVED        : 29;
        } RFTL_B;
    };

    /* @brief Transmission FIFO level register */
    union
    {
        __IOM uint32_t TFL;
        struct
        {
            __IOM uint32_t TFL             : 4;
            __IM  uint32_t RESERVED        : 28;
        } TFL_B;
    };

    /* @brief Reception FIFO level register */
    union
    {
        __IOM uint32_t RFL;
        struct
        {
            __IOM uint32_t RFL             : 4;
            __IM  uint32_t RESERVED        : 28;
        } RFL_B;
    };

    /* @brief Status register */
    union
    {
        __IOM uint32_t STS;
        struct
        {
            __IOM uint32_t BUSYF           : 1;
            __IOM uint32_t TFNF            : 1;
            __IOM uint32_t TFEF            : 1;
            __IOM uint32_t RFNEF           : 1;
            __IOM uint32_t RFFF            : 1;
            __IM  uint32_t RESERVED        : 27;
        } STS_B;
    };

    /* @brief Interrupt enable register */
    union
    {
        __IOM uint32_t INTEN;
        struct
        {
            __IOM uint32_t TFEIE           : 1;
            __IOM uint32_t TFOIE           : 1;
            __IOM uint32_t RFUIE           : 1;
            __IOM uint32_t RFOIE           : 1;
            __IOM uint32_t RFFIE           : 1;
            __IM  uint32_t RESERVED        : 27;
        } INTEN_B;
    };

    /* @brief Interrupt status register */
    union
    {
        __IM uint32_t ISTS;
        struct
        {
            __IM  uint32_t TFEIF           : 1;
            __IM  uint32_t TFOIF           : 1;
            __IM  uint32_t RFUIF           : 1;
            __IM  uint32_t RFOIF           : 1;
            __IM  uint32_t RFFIF           : 1;
            __IM  uint32_t RESERVED        : 27;
        } ISTS_B;
    };

    /* @brief Raw interrupt register */
    union
    {
        __IM uint32_t RIS;
        struct
        {
            __IM  uint32_t TFEIF           : 1;
            __IM  uint32_t TFOIF           : 1;
            __IM  uint32_t RFUIF           : 1;
            __IM  uint32_t RXOIR           : 1;
            __IM  uint32_t RXFIR           : 1;
            __IM  uint32_t RESERVED        : 27;
        } RIS_B;
    };

    /* @brief Transmission FIFO overflow interrupt clear register */
    union
    {
        __IM uint32_t TFOIC;
        struct
        {
            __IM  uint32_t TFOIC           : 1;
            __IM  uint32_t RESERVED        : 31;
        } TFOIC_B;
    };

    /* @brief Reception FIFO overflow interrupt clear register */
    union
    {
        __IM uint32_t RFOIC;
        struct
        {
            __IM  uint32_t RFOIC           : 1;
            __IM  uint32_t RESERVED        : 31;
        } RFOIC_B;
    };

    /* @brief Reception FIFO underflow interrupt clear register */
    union
    {
        __IM uint32_t RFUIC;
        struct
        {
            __IM  uint32_t RFUIC           : 1;
            __IM  uint32_t RESERVED        : 31;
        } RFUIC_B;
    };

    __IM  uint32_t  RESERVED1;

    /* @brief Interrupt clear register */
    union
    {
        __IM uint32_t ICF;
        struct
        {
            __IM  uint32_t ICF             : 1;
            __IM  uint32_t RESERVED        : 31;
        } ICF_B;
    };

    /* @brief DMA control register */
    union
    {
        __IOM uint32_t DMACTRL;
        struct
        {
            __IOM uint32_t RDMAEN         : 1;
            __IOM uint32_t TDMAEN         : 1;
            __IM  uint32_t RESERVED       : 30;
        } DMACTRL_B;
    };

    /* @brief DMA Tx data level register */
    union
    {
        __IOM uint32_t DMATDL;
        struct
        {
            __IOM uint32_t DMATDL         : 3;
            __IM  uint32_t RESERVED       : 29;
        } DMATDL_B;
    };
    /* @brief DMA Rx data level register */
    union
    {
        __IOM uint32_t DMARDL;
        struct
        {
            __IOM uint32_t DMARDL         : 3;
            __IM  uint32_t RESERVED       : 29;
        } DMARDL_B;
    };

    __IM  uint32_t RESERVED2[2];

    /* @brief Data register */
    union
    {
        __IOM uint32_t DATA;
        struct
        {
            __IOM  uint32_t DATA           : 32;
        } DATA_B;
    };

    __IM  uint32_t RESERVED3[35];

    /* @brief Reception sample register */
    union
    {
        __IOM uint32_t RSD;
        struct
        {
            __IOM uint32_t RSD             : 8;
            __IM  uint32_t RESERVED1       : 8;
            __IOM uint32_t RSE             : 1;
            __IM  uint32_t RESERVED2       : 15;
        } RSD_B;
    };

    /* @brief Reception sample register */
    union
    {
        __IOM uint32_t CTRL3;
        struct
        {
            __IOM uint32_t IAT                    : 2;
            __IOM uint32_t ADDRLEN                : 4;
            __IM  uint32_t RESERVED1              : 2;
            __IOM uint32_t INSLEN                 : 2;
            __IM  uint32_t RESERVED2              : 1;
            __IOM uint32_t WAITCYC                : 5;
            __IM  uint32_t RESERVED3              : 14;
            __IOM uint32_t CSEN                   : 1;
            __IM  uint32_t RESERVED4              : 1;
        } CTRL3_B;
    };

    __IM  uint32_t  RESERVED4[2];

    union
    {
        __IOM uint32_t XIP_INCR_INST;

        struct
        {
            __IOM uint32_t INCR_INST        : 16;
            __IM  uint32_t RESERVED         : 16;
        } XIP_INCR_INST_B;
    };

    union
    {
        __IOM uint32_t XIP_WRAP_INST;

        struct
        {
            __IOM uint32_t WRAP_INST        : 16;
            __IM  uint32_t RESERVED         : 16;
        } XIP_WRAP_INST_B;
    };

    union
    {
        __IOM uint32_t XIP_CTRL;

        struct
        {
            __IOM uint32_t FRF              : 2;
            __IOM uint32_t TRANS_TYPE       : 2;
            __IOM uint32_t ADDR_L           : 4;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t INST_L           : 2;
            __IM  uint32_t RESERVED2        : 2;
            __IOM uint32_t WAIT_CYCLES      : 5;
            __IOM uint32_t DFS_HC           : 1;
            __IM  uint32_t RESERVED3        : 3;
            __IOM uint32_t INST_EN          : 1;
            __IOM uint32_t CONT_XFER_EN     : 1;
            __IM  uint32_t RESERVED4        : 5;
            __IOM uint32_t XIP_PREFETCH_EN  : 1;
            __IM  uint32_t RESERVED5        : 2;
        } XIP_CTRL_B;
    };

    union
    {
        __IOM uint32_t XIP_SER;

        struct
        {
            __IOM uint32_t SER              : 1;
            __IM  uint32_t RESERVED         : 31;
        } XIP_SER_B;
    };

